# CannotDuplicateType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotDuplicateType Property
BuiltInFailures..::..EditingFailures Class See Also
---
Cannot Duplicate Type
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDuplicateType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDuplicateType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDuplicateType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace